export const faultData = [
  {
    title: "内容一：制动系统故障",
    id: "s1",
    scenes: [
      {
        id: "s1-1",
        name: "场景一：列车紧制不缓解",
        detail:
          "故障现象：列车突发紧急制动，“车辆显示屏”状态栏显示紧急制动，“信号显示屏”显示紧急制动图标，气压表红色指针指向 3Bar，列车无法动车。",
        path: "/scene/列车紧制不缓解?s=c1s1",
      },
      {
        id: "s1-2",
        name: "场景二：列车停放制动施加、缓解灯不亮",
        detail:
          "故障现象：警惕按钮发生故障，触发紧急制动，“车辆显示屏”状态栏显示“牵引封锁、无人警惕”，列车无法动车。",
        path: "/scene/列车停放制动施加、缓解灯不亮?s=c1s2",
      },
      {
        id: "s1-3",
        name: "场景三：列车所有气制动缓解灯不亮",
        detail:
          "故障现象：列车牵引后自行产生制动停车，动车过程中列车“所有气制动缓解”灯不亮，“车辆显示屏”无制动故障显示，列车无法动车。",
        path: "/scene/列车所有气制动缓解灯不亮?s=c1s3",
      },
    ],
  },
  {
    id: "s2",
    title: "内容二：牵引系统故障",
    scenes: [
      {
        id: "s2-1",
        name: "场景一：牵引电机故障",
        detail:
          "故障现象：“车辆显示屏”显示牵引电机 3 个图标红点，列车无法动车。",
        path: "/scene/牵引电机故障1?s=c2s1",
      },
      {
        id: "s2-2",
        name: "场景二：牵引电机故障2",
        detail:
          "故障现象：“车辆显示屏”显示牵引电机 1 个图标红点，列车可以维持运行。",
        path: "/scene/牵引电机故障2?s=c2s2",
      },
      {
        id: "s2-3",
        name: "场景三：牵引封锁/激活故障",
        detail:
          "故障现象：ATO 启动灯不亮，尝试 ATO 模式动车且推主控手柄，“车辆显示屏”显示“牵引封锁/激活故障”，列车无法动车。",
        path: "/scene/牵引封锁激活故障?s=c2s3",
      },
    ],
  },
  {
    id: "s3",
    title: "内容三：辅助系统故障",
    scenes: [
      {
        id: "s3-1",
        name: "场景一：辅助逆变器图标显示异常",
        detail:
          "“车辆显示屏”显示辅助逆变器图标红点故障，所有空调只有紧急通风，列车无法动车。",
        path: "/scene/辅助逆变器图标异常?s=c3s1",
      },
      {
        id: "s3-2",
        name: "场景二：激活端B车失电",
        detail:
          "从激活端单元“车辆显示屏”上会显示 B 车所有车门打开、制动图标显示为 P、空调不工作等，列车无法动车。",
        path: "/scene/激活端B车失电?s=c3s2",
      },
      {
        id: "s3-3",
        name: "场景三：车辆显示屏黑屏",
        detail: "“车辆显示屏”黑屏，列车无法动车。",
        path: "/scene/显示屏黑屏?s=c3s3",
      },
    ],
  },
  {
    id: "s4",
    title: "内容四：车门故障",
    scenes: [
      {
        id: "s4-1",
        name: "场景一：“所有车门关闭”指示灯不亮",
        detail: "列车“所有车门关闭”指示灯不亮，列车无法动车。",
        path: "/scene/车门关闭指示灯不亮?s=c4s1",
      },
    ],
  },
  {
    id: "s5",
    title: "内容五：高压设备故障",
    scenes: [
      {
        id: "s5-1",
        name: "场景一：受电弓降弓追停区间",
        detail:
          "“车辆显示屏”显示网压为零，且受电弓图标显示两受电弓均降下，受电弓“降”灯亮，列车无法动车。",
        path: "/scene/受电弓降弓追停?s=c5s1",
      },
      {
        id: "s5-2",
        name: "场景二：主断合灯不亮",
        detail:
          "主断合灯不亮，“车辆显示屏”显示网压正常，两受电弓均正常，列车无法动车。",
        path: "/scene/主断合灯不亮?s=c5s2",
      },
    ],
  },
];
